/**
 * Created by Glen Lin on 2020/7/24.
 */

/*
* 列表的完整抽象数据类型定义：
*   listSize(属性)    列表的元素个数
*   pos(属性)         返回列表中元素的个数
*   length(方法)      返回列表元素中的个数
*   clear（方法）      清空列表所有元素
*   toString(方法)    返回列表字符串形式
*   getElement(方法)  返回当前位置的元素
*   insert(方法)      在现有元素后面插入新元素
*   append(方法)      在列表的末尾添加新元素
*   remove(方法)      从列表中删除元素
*   front(方法)       将列表的当前位置移动到第一个元素
*   end(方法)         将列表的当前位置移动到最后一位元素
*   prev（方法）       将当前位置移动到前一个元素
*   next(方法)        将当前位置移动到下一个元素
*   currPos（方法）    返回列表当前的位置
*   moveTo(方法)      将当前位置移动到指定位置
* */



